foxval/esp-idf/components/soc/esp32c/include/soc/gpio_reg.h
#define GPIO_PIN49_REG          (DR_REG_GPIO_BASE + 0x138)
/* GPIO_PIN49_INT_ENA : R/W ;bitpos:[17:13] ;default: 5'h0 ; */
/*description: */
#define GPIO_PIN49_INT_ENA  0x0000001F
#define GPIO_PIN49_INT_ENA_M  ((GPIO_PIN49_INT_ENA_V)<<(GPIO_PIN49_INT_ENA_S))
#define GPIO_PIN49_INT_ENA_V  0x1F
#define GPIO_PIN49_INT_ENA_S  13
/* GPIO_PIN49_CONFIG : R/W ;bitpos:[12:11] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN49_CONFIG  0x00000003
#define GPIO_PIN49_CONFIG_M  ((GPIO_PIN49_CONFIG_V)<<(GPIO_PIN49_CONFIG_S))
#define GPIO_PIN49_CONFIG_V  0x3
#define GPIO_PIN49_CONFIG_S  11
/* GPIO_PIN49_WAKEUP_ENABLE : R/W ;bitpos:[10] ;default: 1'h0 ; */
/*description: */
#define GPIO_PIN49_WAKEUP_ENABLE  (BIT(10))
#define GPIO_PIN49_WAKEUP_ENABLE_M  (BIT(10))
#define GPIO_PIN49_WAKEUP_ENABLE_V  0x1
#define GPIO_PIN49_WAKEUP_ENABLE_S  10
/* GPIO_PIN49_INT_TYPE : R/W ;bitpos:[9:7] ;default: 3'h0 ; */
/*description: */
#define GPIO_PIN49_INT_TYPE  0x00000007
#define GPIO_PIN49_INT_TYPE_M  ((GPIO_PIN49_INT_TYPE_V)<<(GPIO_PIN49_INT_TYPE_S))
#define GPIO_PIN49_INT_TYPE_V  0x7
#define GPIO_PIN49_INT_TYPE_S  7
/* GPIO_PIN49_SYNC1_BYPASS : R/W ;bitpos:[4:3] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN49_SYNC1_BYPASS  0x00000003
#define GPIO_PIN49_SYNC1_BYPASS_M  ((GPIO_PIN49_SYNC1_BYPASS_V)<<(GPIO_PIN49_SYNC1_BYPASS_S))
#define GPIO_PIN49_SYNC1_BYPASS_V  0x3
#define GPIO_PIN49_SYNC1_BYPASS_S  3
/* GPIO_PIN49_PAD_DRIVER : R/W ;bitpos:[2] ;default: 1'h0 ; */
/*description: */
#define GPIO_PIN49_PAD_DRIVER  (BIT(2))
#define GPIO_PIN49_PAD_DRIVER_M  (BIT(2))
#define GPIO_PIN49_PAD_DRIVER_V  0x1
#define GPIO_PIN49_PAD_DRIVER_S  2
/* GPIO_PIN49_SYNC2_BYPASS : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN49_SYNC2_BYPASS  0x00000003
#define GPIO_PIN49_SYNC2_BYPASS_M  ((GPIO_PIN49_SYNC2_BYPASS_V)<<(GPIO_PIN49_SYNC2_BYPASS_S))
#define GPIO_PIN49_SYNC2_BYPASS_V  0x3
#define GPIO_PIN49_SYNC2_BYPASS_S  0

#define GPIO_PIN50_REG          (DR_REG_GPIO_BASE + 0x13C)
/* GPIO_PIN50_INT_ENA : R/W ;bitpos:[17:13] ;default: 5'h0 ; */
/*description: */
#define GPIO_PIN50_INT_ENA  0x0000001F
#define GPIO_PIN50_INT_ENA_M  ((GPIO_PIN50_INT_ENA_V)<<(GPIO_PIN50_INT_ENA_S))
#define GPIO_PIN50_INT_ENA_V  0x1F
#define GPIO_PIN50_INT_ENA_S  13
/* GPIO_PIN50_CONFIG : R/W ;bitpos:[12:11] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN50_CONFIG  0x00000003
#define GPIO_PIN50_CONFIG_M  ((GPIO_PIN50_CONFIG_V)<<(GPIO_PIN50_CONFIG_S))
#define GPIO_PIN50_CONFIG_V  0x3
#define GPIO_PIN50_CONFIG_S  11
/* GPIO_PIN50_WAKEUP_ENABLE : R/W ;bitpos:[10] ;default: 1'h0 ; */
/*description: */
#define GPIO_PIN50_WAKEUP_ENABLE  (BIT(10))
#define GPIO_PIN50_WAKEUP_ENABLE_M  (BIT(10))
#define GPIO_PIN50_WAKEUP_ENABLE_V  0x1
#define GPIO_PIN50_WAKEUP_ENABLE_S  10
/* GPIO_PIN50_INT_TYPE : R/W ;bitpos:[9:7] ;default: 3'h0 ; */
/*description: */
#define GPIO_PIN50_INT_TYPE  0x00000007
#define GPIO_PIN50_INT_TYPE_M  ((GPIO_PIN50_INT_TYPE_V)<<(GPIO_PIN50_INT_TYPE_S))
#define GPIO_PIN50_INT_TYPE_V  0x7
#define GPIO_PIN50_INT_TYPE_S  7
/* GPIO_PIN50_SYNC1_BYPASS : R/W ;bitpos:[4:3] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN50_SYNC1_BYPASS  0x00000003
#define GPIO_PIN50_SYNC1_BYPASS_M  ((GPIO_PIN50_SYNC1_BYPASS_V)<<(GPIO_PIN50_SYNC1_BYPASS_S))
#define GPIO_PIN50_SYNC1_BYPASS_V  0x3
#define GPIO_PIN50_SYNC1_BYPASS_S  3
/* GPIO_PIN50_PAD_DRIVER : R/W ;bitpos:[2] ;default: 1'h0 ; */
/*description: */
#define GPIO_PIN50_PAD_DRIVER  (BIT(2))
#define GPIO_PIN50_PAD_DRIVER_M  (BIT(2))
#define GPIO_PIN50_PAD_DRIVER_V  0x1
#define GPIO_PIN50_PAD_DRIVER_S  2
/* GPIO_PIN50_SYNC2_BYPASS : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN50_SYNC2_BYPASS  0x00000003
#define GPIO_PIN50_SYNC2_BYPASS_M  ((GPIO_PIN50_SYNC2_BYPASS_V)<<(GPIO_PIN50_SYNC2_BYPASS_S))
#define GPIO_PIN50_SYNC2_BYPASS_V  0x3
#define GPIO_PIN50_SYNC2_BYPASS_S  0

#define GPIO_PIN51_REG          (DR_REG_GPIO_BASE + 0x140)
/* GPIO_PIN51_INT_ENA : R/W ;bitpos:[17:13] ;default: 5'h0 ; */
/*description: */
#define GPIO_PIN51_INT_ENA  0x0000001F
#define GPIO_PIN51_INT_ENA_M  ((GPIO_PIN51_INT_ENA_V)<<(GPIO_PIN51_INT_ENA_S))
#define GPIO_PIN51_INT_ENA_V  0x1F
#define GPIO_PIN51_INT_ENA_S  13
/* GPIO_PIN51_CONFIG : R/W ;bitpos:[12:11] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN51_CONFIG  0x00000003
#define GPIO_PIN51_CONFIG_M  ((GPIO_PIN51_CONFIG_V)<<(GPIO_PIN51_CONFIG_S))
#define GPIO_PIN51_CONFIG_V  0x3
#define GPIO_PIN51_CONFIG_S  11
/* GPIO_PIN51_WAKEUP_ENABLE : R/W ;bitpos:[10] ;default: 1'h0 ; */
/*description: */
#define GPIO_PIN51_WAKEUP_ENABLE  (BIT(10))
#define GPIO_PIN51_WAKEUP_ENABLE_M  (BIT(10))
#define GPIO_PIN51_WAKEUP_ENABLE_V  0x1
#define GPIO_PIN51_WAKEUP_ENABLE_S  10
/* GPIO_PIN51_INT_TYPE : R/W ;bitpos:[9:7] ;default: 3'h0 ; */
/*description: */
#define GPIO_PIN51_INT_TYPE  0x00000007
#define GPIO_PIN51_INT_TYPE_M  ((GPIO_PIN51_INT_TYPE_V)<<(GPIO_PIN51_INT_TYPE_S))
#define GPIO_PIN51_INT_TYPE_V  0x7
#define GPIO_PIN51_INT_TYPE_S  7
/* GPIO_PIN51_SYNC1_BYPASS : R/W ;bitpos:[4:3] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN51_SYNC1_BYPASS  0x00000003
#define GPIO_PIN51_SYNC1_BYPASS_M  ((GPIO_PIN51_SYNC1_BYPASS_V)<<(GPIO_PIN51_SYNC1_BYPASS_S))
#define GPIO_PIN51_SYNC1_BYPASS_V  0x3
#define GPIO_PIN51_SYNC1_BYPASS_S  3
/* GPIO_PIN51_PAD_DRIVER : R/W ;bitpos:[2] ;default: 1'h0 ; */
/*description: */
#define GPIO_PIN51_PAD_DRIVER  (BIT(2))
#define GPIO_PIN51_PAD_DRIVER_M  (BIT(2))
#define GPIO_PIN51_PAD_DRIVER_V  0x1
#define GPIO_PIN51_PAD_DRIVER_S  2
/* GPIO_PIN51_SYNC2_BYPASS : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN51_SYNC2_BYPASS  0x00000003
#define GPIO_PIN51_SYNC2_BYPASS_M  ((GPIO_PIN51_SYNC2_BYPASS_V)<<(GPIO_PIN51_SYNC2_BYPASS_S))
#define GPIO_PIN51_SYNC2_BYPASS_V  0x3
#define GPIO_PIN51_SYNC2_BYPASS_S  0

#define GPIO_PIN52_REG          (DR_REG_GPIO_BASE + 0x144)
/* GPIO_PIN52_INT_ENA : R/W ;bitpos:[17:13] ;default: 5'h0 ; */
/*description: */
#define GPIO_PIN52_INT_ENA  0x0000001F
#define GPIO_PIN52_INT_ENA_M  ((GPIO_PIN52_INT_ENA_V)<<(GPIO_PIN52_INT_ENA_S))
#define GPIO_PIN52_INT_ENA_V  0x1F
#define GPIO_PIN52_INT_ENA_S  13
/* GPIO_PIN52_CONFIG : R/W ;bitpos:[12:11] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN52_CONFIG  0x00000003
#define GPIO_PIN52_CONFIG_M  ((GPIO_PIN52_CONFIG_V)<<(GPIO_PIN52_CONFIG_S))
#define GPIO_PIN52_CONFIG_V  0x3
#define GPIO_PIN52_CONFIG_S  11
/* GPIO_PIN52_WAKEUP_ENABLE : R/W ;bitpos:[10] ;default: 1'h0 ; */
/*description: */
#define GPIO_PIN52_WAKEUP_ENABLE  (BIT(10))
#define GPIO_PIN52_WAKEUP_ENABLE_M  (BIT(10))
#define GPIO_PIN52_WAKEUP_ENABLE_V  0x1
#define GPIO_PIN52_WAKEUP_ENABLE_S  10
/* GPIO_PIN52_INT_TYPE : R/W ;bitpos:[9:7] ;default: 3'h0 ; */
/*description: */
#define GPIO_PIN52_INT_TYPE  0x00000007
#define GPIO_PIN52_INT_TYPE_M  ((GPIO_PIN52_INT_TYPE_V)<<(GPIO_PIN52_INT_TYPE_S))
#define GPIO_PIN52_INT_TYPE_V  0x7
#define GPIO_PIN52_INT_TYPE_S  7
/* GPIO_PIN52_SYNC1_BYPASS : R/W ;bitpos:[4:3] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN52_SYNC1_BYPASS  0x00000003
#define GPIO_PIN52_SYNC1_BYPASS_M  ((GPIO_PIN52_SYNC1_BYPASS_V)<<(GPIO_PIN52_SYNC1_BYPASS_S))
#define GPIO_PIN52_SYNC1_BYPASS_V  0x3
#define GPIO_PIN52_SYNC1_BYPASS_S  3
/* GPIO_PIN52_PAD_DRIVER : R/W ;bitpos:[2] ;default: 1'h0 ; */
/*description: */
#define GPIO_PIN52_PAD_DRIVER  (BIT(2))
#define GPIO_PIN52_PAD_DRIVER_M  (BIT(2))
#define GPIO_PIN52_PAD_DRIVER_V  0x1
#define GPIO_PIN52_PAD_DRIVER_S  2
/* GPIO_PIN52_SYNC2_BYPASS : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN52_SYNC2_BYPASS  0x00000003
#define GPIO_PIN52_SYNC2_BYPASS_M  ((GPIO_PIN52_SYNC2_BYPASS_V)<<(GPIO_PIN52_SYNC2_BYPASS_S))
#define GPIO_PIN52_SYNC2_BYPASS_V  0x3
#define GPIO_PIN52_SYNC2_BYPASS_S  0

